'''

2021年4月26日，刚开始接触python，刚好需要给娃起名。通过字的筛选、组合称名字，根据名字测试网站进行名字评分，最终在最高评分的名字中选择合适的。

'''

#根据牛年适合做名字的偏旁以及比划数找到符合的字
che_h=['车','轧','轨','轪','轫','轩','轭','轰','轮','软','转','轱','轷','轲','轹','轻','轳','轺','轶','轸','轵','轴','辂','较','辁','轼','辀','轾','载','珲','轿']
che_p=['che ','zha ','gui ','dai ','ren ','xuan ','e ','hong ','lun ','ruan ','zhuan ','gu ','hu ','ke ','li ','qing ','lu ','yao ','yi ','zhen ','zhi ','zhou ','lu ','jiao ','quan',' shi ','zhou ','zhi ','zai ','hui ','jiao ']

baogai_h=['宁','它','宂','宄','安','守','宅','宆','宇','宑','宍','宎','完','宊','宋','宐','宒','宏','宝','宠','宕','定','官','宓','审','实','宛','宜','宙','宔','宗','宖','実','宫','宦','客','宬','室','宪','宣','宥','宻','宷','宯','宱','宸','家','宽','宭','容','宵','宴','宮']
baogai_p=['ning ','ta ','rong ','gui ','an ','shou ','zhai ','kong ','yu ','jing ','rou ','yao ','wan ','tu ','song ','yi ','zhun ','hong ','bao ','chong ','dang ','ding ','guan ','mi ','shen ','shi ','wan ','yi ','zhou ','zhu ','zong ','hong ','shi ','gong ','huan ','ke ','cheng ','shi ','xian ','xuan ','you ','mi ','pan ','xiao ','zha ','chen ','jia ','kuan ','jiong ','rong ','xiao ','yan ','gong ']

yu_h=['羽','羿','羾','翄','翅','翀','翃','翁','翆','翂','翎','翈','翊','翌','習','翉','翍','翇','翋','翏','翑','翐','翚','翙','翘','翕','翔','翛','翗','翖','翓']
yu_p=['yu ','yi ','gong ','chi ','chi ','chong ','hong ','weng ','cui ','fen ','ling ','xia ','yi ','yi ','xi ','ben ','bi ','fu ','la ','liu ','yu ','zhi ','hui ','hui ','qiao ','xi ','xiang ','xiao ','ke ','xi ','xie ']

you_h=['酉','酊','酋','酐','配','酏','酒','酎','酌','酑','酖','酘','酚','酕','酞','酗','酝','酜','酓','酛','酙','酔','酦','酤','酣','酥','酢','酡','酠','酟''酉','酊','酋','酐','配','酏','酒','酎','酌','酑','酖','酘','酚','酕','酞','酗','酝','酜','酓','酛','酙','酔','酦','酤','酣','酥','酢','酡','酠','酟']
you_p=['you ','ding ','qiu ','gan ','pei ','yi ','jiu ','zhou ','zhuo ','yu ','dan ','dou ','fen ','mao ','tai ','xu ','yun ','fu ','yan ','yuan ','zhen ','zui ','po ','gu ','han ','su ','zuo ','tuo ','qia ','tian ''you ','ding ','qiu ','gan ','pei ','yi ','jiu ','zhou ','zhuo ','yu ','dan ','dou ','fen ','mao ','tai ','xu ','yun ','fu ','yan ','yuan ','zhen ','zui ','po ','gu ','han ','su ','zuo ','tuo ','qia ','tian ']

he_h=['禾','私','秃','秀','秂','禿','秉','秊','秆','秄','秊','秈','秇','秕','秬','种','秔','秖','秌','秅','秎','秏','秐','秓','秗','科','秒','秭','秋','秞','秪','秨','租','秚','秮','秙','秝','秢','秜','秥','秘','称','秤','积','秣','秦','秫','秧','秩','秡','秛','秠','秳','秹','秲','秱','秵','秷','秼','秺','秴','秶','秽','秸','稆','秾','移']
he_p=['he ','si ','tu ','xiu ','ren ','tu ','bing ','nian ','gan ','zi ','nian ','xian ','zhi ','bi ','ju ','zhong ','jing ','zhi ','qiu ','na ','fen ','mao ','yun ','zhi ','yu ','ke ','miao ','zi ','qiu ','you ','zhi ','zuo ','zu ','ban ','huo ','ku ','li ','ling ','ni ','nian ','mi ','cheng ','cheng ','ji ','mo ','qin ','shu ','yang ','zhi ','bo ','pi ','pi ','kuo ','ren ','zhi ','tong ','yin ','zhi ','zhu ','du ','ge ','zi ','hui ','jie ','lü ','nong ','yi ']

tian_h=['甴','电','甲','申','田','由','甶','町','甸','男','甼','甹','畀','畅','畁','畂','畄','甽','畃','画','甿','甾','畈','界','畎','畑','畏','畇','畐','畊','畋','畉','畍','畆','畒','畓','畚','畜','畟','留','畔','畠','畖','畛','畢','畝','畗','畕','畞','畘','略','畦','畤','異','畧','畣','畨','畡','畩']
tian_p=['you ','dian ','jia ','shen ','tian ','you ','fu ','ding ','dian ','nan ','ding ','ping ','bi ','chang ','bi ','liu ','liu ','quan ','sun ','hua ','mang ','zai ','fan ','jie ','quan ','tian ','wei ','yun ','bi ','geng ','tian ','fu ','jie ','mu ','mu ','tap ','ben ','chu ','ji ','liu ','pan ','tian ','wa ','zhen ','bi ','mu ','fu ','jiang ','mu ','nan ','lue ','qi ','zhi ','yi ','lue ','da ','pan ','gai ','yi ']

cao_h=['艾','艻','艿','节','艼','芁','芀','艽','芒','芃','芑','芗','芎','芏','芨','芕','芌','芅','芖','芓','芉','芐','芇','芋','芊','芄','芍','芝','芆','芢','芛','茾','苆','芠','苃','芺','苀','芶','芫','苡','芸','苎','芿','芚','芲','苇','芜','苋','芯','芧','芽','苅','芵','芮','芟','苏','苂','芦','芼','苉','芪','芡','芹','芩','芴','花','芰','苣','芤','苈','芭','芞','芾','芬','苁','芙','芣','芥','苊','苌','芳','芘','苄','苍','芷','苨','苩','茐','苐','苰','茋','茊','若','苫','苕','苔','茓','苢','英','茔','苲','茁','茌','苽','苝','苪','茂','苗','苠','茉','苜','茑','苶','苧','苤','苹','苘','茕','苒','苦','茄','茎','苴','苛','苓','茏','茆','茅','茚','苵','苑','苙','苖','苮','苬','苭','苚','苼','茒','苿','苾','茀','苺','苷','茇','苞','苯','范','苻','苟','苳','苸','茜','荞','荁','茹','荪','荈','茨','荙','茗','荨','荑','莛','荣','荂','茩','茪','茥','茠','茤','荋','茼','荥','荇','荀','药','茵','荫','荧','荮','茱','茘','茲','荝','茞','荿','荎','茦','荃','荛','荩','荤','荠','荚','茭','茮','荊','茢','茙','茍','茯','荄','茖','茛','荭','荒','茴','荡','荐','茳','荆','莒','荖','荕','荅','荜','草','茬','茺','茶','茧','荔','荦','荬','荟','茫','荏','茸','茈','荍','荓','荗','茟','莚','茰','荢','荘','荌','茷','茽','茿','茡','莝','荻','莪','荸','莨','莉','莍','菃','荵','荰','莼','莵','荾','莏','莌','莑','莯','莮','莻','莥','菦','莣','荱','获','莙','荴','莄','莩','荷','莞','莢','莖','莳','荼','荽','莴','莶','莺','莹','莜','莸','莠','華','莕','莅','莲','莽','莓','莫','莆','莎','莘','莡','荳','莈','莦','莤','莧','莂','荹','莗','莀','莐','莁','莃','荶','荺','莇','莊','茣','莟','莋','莭','荲','莔','莬','茝','莰','莱']
cao_p=['ai ','le ','nai ','jie ','ding ','jiao ','tiao ','jiao ','mang ','peng ','qi ','xiang ','xiong ','du ','ji ','sui ','yu ','yi ','zhi ','zi ','gan ','hu ','mian ','yu ','qian ','wan ','shao ','zhi ','cha ','ren ','wei ','qian ','qie ','wen ','you ','ao ','hang ','ji ','yuan ','yi ','yun ','zhu ','reng ','tun ','hua ','wei ','wu ','xian ','xin ','xu ','ya ','yi ','jue ','rui ','shan ','su ','yin ','lu ','mao ','pi ','qi ','qian ','qin ','qin ','wu ','hua ','ji ','ju ','kou ','li ','ba ','qi ','fei ','fen ','cong ','fu ','fou ','jie ','e ','chang ','fang ','pi ','bian ','cang ','zhi ','ni ','bo ','cong ','di ','hong ','zhi ','zi ','ruo ','shan ','tiao ','tai ','xue ','yi ','ying ','ying ','zha ','zhuo ','chi ','gu ','bei ','bing ','mao ','miao ','min ','mo ','mu ','niao ','nie ','zhu ','pie ','ping ','qing ','qiong ','ran ','ku ','qie ','jing ','ju ','ke ','ling ','long ','mao ','mao ','yin ','die ','yuan ','li ','di ','xian ','xiu ','yao ','yong ','sheng ','茒','wei ','bi ','bo ','mei ','gan ','ba ','bao ','ben ','fan ','fu ','gou ','dong ','hu ','qian ','qiao ','huan ','ru ','sun ','chuan ','ci ','da ','ming ','qian ','yi ','ting ','rong ','fu ','gou ','guang ','gui ','hao ','duo ','er ','tong ','ying ','xing ','xun ','yao ','yin ','yin ','ying ','zhou ','zhu ','li ','zi ','ce ','chen ','cheng ','qi ','ci ','quan ','rao ','jin ','hun ','qi ','jia ','jiao ','niao ','jing ','lie ','rong ','ji ','fu ','gai ','luo ','gen ','hong ','huang ','hui ','dang ','jian ','jiang ','jing ','ju ','lao ','jin ','da ','bi ','cao ','cha ','chong ','cha ','jian ','li ','luo ','mai ','hui ','mang ','ren ','rong ','zi ','qiao ','peng ','shu ','wei ','yan ','yu ','yu ','zhuang ','an ','pei ','zhong ','zhu ','zi ','cuo ','di ','e ','bi ','lang ','li ','qiu ','qu ','ren ','du ','chun ','tu ','sui ','suo ','tuo ','peng ','mu ','nan ','neus ','niu ','qin ','wang ','wei ','huo ','jun1 ','fu ','geng ','piao ','he ','wan ','jia ','jing ','shi ','tu ','sui ','wo ','xian ','ying ','ying ','you ','you ','you ','hua ','xing ','li ','lian ','mang ','mei ','mo ','pu ','sha ','shen ','cuo ','dou ','mo ','xiao ','you ','xian ','bie ','bu ','che ','nong ','chen ','wu ','xi ','yin ','yun ','zhu ','zhuang ','wu ','han ','ji ','jie ','li ','meng ','wan ','zhi ','kan ','lai ']

#凡是包含一下生母的拼音都踢出
cannot_in=['f','p','m']

###########
i=0
while i in range(len(che_h)):
    if (cannot_in[0] in che_p[i] or cannot_in[1] in che_p[i] or cannot_in[2] in che_p[i]):
        che_h.remove(che_h[i]); che_p.remove(che_p[i]);i-=1
    else: i+=1
print(che_h);print(che_p)

###########
j=0
while j in range(len(baogai_h)):
    if (cannot_in[0] in baogai_p[j] or cannot_in[1] in baogai_p[j] or cannot_in[2] in baogai_p[j]):
        baogai_h.remove(baogai_h[j]); baogai_p.remove(baogai_p[j]);j-=1
    else: j+=1
    
print(baogai_h);print(baogai_p)

###########
k=0
while k in range(len(yu_h)):
    if (cannot_in[0] in yu_p[k] or cannot_in[1] in yu_p[k] or cannot_in[2] in yu_p[k]):
        yu_h.remove(yu_h[k]); yu_p.remove(yu_p[k]);k-=1
    else: k+=1
    
print(yu_h);print(yu_p)

###########
m=0
while m in range(len(tian_h)):
    if (cannot_in[0] in tian_p[m] or cannot_in[1] in tian_p[m] or cannot_in[2] in tian_p[m]):
        tian_h.remove(tian_h[m]); tian_p.remove(tian_p[m]);m-=1
    else: m+=1
    
print(tian_h);print(tian_p)

###########
n=0
while n in range(len(cao_h)):
    if (cannot_in[0] in cao_p[n] or cannot_in[1] in cao_p[n] or cannot_in[2] in cao_p[n]):
        cao_h.remove(cao_h[n]); cao_p.remove(cao_p[n]);n-=1
    else: n+=1
    
print(cao_h);print(cao_p)

###########
m=0
while m in range(len(he_h)):
    if (cannot_in[0] in he_p[m] or cannot_in[1] in he_p[m] or cannot_in[2] in he_p[m]):
        he_h.remove(he_h[m]); he_p.remove(he_p[m]);m-=1
    else: m+=1
    
print(he_h);print(he_p)

###########
n=0
while n in range(len(you_h)):
    if (cannot_in[0] in you_p[n] or cannot_in[1] in you_p[n] or cannot_in[2] in you_p[n]):
        you_h.remove(you_h[n]); you_p.remove(you_p[n]);n-=1
    else: n+=1
    
print(you_h);print(you_p)
       

#根据结果以及挑选的合适的字得出以下结果
import itertools

h_che=['轩','轲','轼']
p_che=['xuan','ke','shi']

h_baogai=['宁','安','宆','宐','实','宜','宖','宣','宸','家','容']
p_baogai=['ning','an','qiong','yi','shi','yi','hong','xuan','chen','jia','rong']

h_yu=['羿','翀','翎','翊','翐','翕','翓']
p_yu=['yi','chong','ling','yi','zhi','xi','xie']

h_tian=['甲','申','畅','畇']
p_tian=['jia','shen','chang','yun']

h_he=['禾','秉','科','秞','秩','秷']
p_he=['he','bing','ke','you','zhi','zhi']

h_you=['酟']
p_you=['tian']

h_cao=['苏','蔚','芫','茂']
p_cao=['su','wei','yuan','mao']

h_candidate=[h_che,h_baogai,h_yu,h_tian,h_he,h_you,h_cao]
p_candidate=[p_che,p_baogai,p_yu,p_tian,p_he,p_you,p_cao]

h_text=open('/Users/danawang/Desktop/h_test.txt','a')
p_text=open('/Users/danawang/Desktop/p_test.txt','a')
wheel=0
#将合适的字俩俩组合并输出到文本中
while wheel in range(len(h_candidate)):
    i=0
    j=0
    h_lastname=[]
    p_lastname=[]
    
    while i in range(len(h_candidate)):
        if i != wheel:
            h_lastname+=h_candidate[i];i+=1
        else:
            i+=1
    for h_name in itertools.product(h_candidate[wheel],h_lastname):
        h_exchange=' '.join(h_name)
        h_text.write(h_exchange + ",")
    
    while j in range(len(p_candidate)):
        if j != wheel:
            p_lastname+=p_candidate[j];j+=1
        else:
            j+=1
    for p_name in itertools.product(p_candidate[wheel],p_lastname):
        p_exchange=' '.join(p_name)
        p_text.write(p_exchange + ",")
    
    wheel+=1
h_text.close()
  
#调用姓名打分网站的服务，根据提交的data填写姓名，将组合得出的名字计算分数并输出cvs
import requests
from bs4 import BeautifulSoup
import pandas as pd

all_h_name=['轩宁','轩安','轩宆','轩宐','轩实','轩宜','轩宖','轩宣','轩宸','轩家','轩容','轩羿','轩翀','轩翎','轩翊','轩翐','轩翕','轩翓','轩甲','轩申','轩畅','轩畇','轩禾','轩秉','轩科','轩秞','轩秩','轩秷','轩酟','轩苏','轩蔚','轩芫','轩茂','轲宁','轲安','轲宆','轲宐','轲实','轲宜','轲宖','轲宣','轲宸','轲家','轲容','轲羿','轲翀','轲翎','轲翊','轲翐','轲翕','轲翓','轲甲','轲申','轲畅','轲畇','轲禾','轲秉','轲科','轲秞','轲秩','轲秷','轲酟','轲苏','轲蔚','轲芫','轲茂','轼宁','轼安','轼宆','轼宐','轼实','轼宜','轼宖','轼宣','轼宸','轼家','轼容','轼羿','轼翀','轼翎','轼翊','轼翐','轼翕','轼翓','轼甲','轼申','轼畅','轼畇','轼禾','轼秉','轼科','轼秞','轼秩','轼秷','轼酟','轼苏','轼蔚','轼芫','轼茂','宁轩','宁轲','宁轼','宁羿','宁翀','宁翎','宁翊','宁翐','宁翕','宁翓','宁甲','宁申','宁畅','宁畇','宁禾','宁秉','宁科','宁秞','宁秩','宁秷','宁酟','宁苏','宁蔚','宁芫','宁茂','安轩','安轲','安轼','安羿','安翀','安翎','安翊','安翐','安翕','安翓','安甲','安申','安畅','安畇','安禾','安秉','安科','安秞','安秩','安秷','安酟','安苏','安蔚','安芫','安茂','宆轩','宆轲','宆轼','宆羿','宆翀','宆翎','宆翊','宆翐','宆翕','宆翓','宆甲','宆申','宆畅','宆畇','宆禾','宆秉','宆科','宆秞','宆秩','宆秷','宆酟','宆苏','宆蔚','宆芫','宆茂','宐轩','宐轲','宐轼','宐羿','宐翀','宐翎','宐翊','宐翐','宐翕','宐翓','宐甲','宐申','宐畅','宐畇','宐禾','宐秉','宐科','宐秞','宐秩','宐秷','宐酟','宐苏','宐蔚','宐芫','宐茂','实轩','实轲','实轼','实羿','实翀','实翎','实翊','实翐','实翕','实翓','实甲','实申','实畅','实畇','实禾','实秉','实科','实秞','实秩','实秷','实酟','实苏','实蔚','实芫','实茂','宜轩','宜轲','宜轼','宜羿','宜翀','宜翎','宜翊','宜翐','宜翕','宜翓','宜甲','宜申','宜畅','宜畇','宜禾','宜秉','宜科','宜秞','宜秩','宜秷','宜酟','宜苏','宜蔚','宜芫','宜茂','宖轩','宖轲','宖轼','宖羿','宖翀','宖翎','宖翊','宖翐','宖翕','宖翓','宖甲','宖申','宖畅','宖畇','宖禾','宖秉','宖科','宖秞','宖秩','宖秷','宖酟','宖苏','宖蔚','宖芫','宖茂','宣轩','宣轲','宣轼','宣羿','宣翀','宣翎','宣翊','宣翐','宣翕','宣翓','宣甲','宣申','宣畅','宣畇','宣禾','宣秉','宣科','宣秞','宣秩','宣秷','宣酟','宣苏','宣蔚','宣芫','宣茂','宸轩','宸轲','宸轼','宸羿','宸翀','宸翎','宸翊','宸翐','宸翕','宸翓','宸甲','宸申','宸畅','宸畇','宸禾','宸秉','宸科','宸秞','宸秩','宸秷','宸酟','宸苏','宸蔚','宸芫','宸茂','家轩','家轲','家轼','家羿','家翀','家翎','家翊','家翐','家翕','家翓','家甲','家申','家畅','家畇','家禾','家秉','家科','家秞','家秩','家秷','家酟','家苏','家蔚','家芫','家茂','容轩','容轲','容轼','容羿','容翀','容翎','容翊','容翐','容翕','容翓','容甲','容申','容畅','容畇','容禾','容秉','容科','容秞','容秩','容秷','容酟','容苏','容蔚','容芫','容茂','羿轩','羿轲','羿轼','羿宁','羿安','羿宆','羿宐','羿实','羿宜','羿宖','羿宣','羿宸','羿家','羿容','羿甲','羿申','羿畅','羿畇','羿禾','羿秉','羿科','羿秞','羿秩','羿秷','羿酟','羿苏','羿蔚','羿芫','羿茂','翀轩','翀轲','翀轼','翀宁','翀安','翀宆','翀宐','翀实','翀宜','翀宖','翀宣','翀宸','翀家','翀容','翀甲','翀申','翀畅','翀畇','翀禾','翀秉','翀科','翀秞','翀秩','翀秷','翀酟','翀苏','翀蔚','翀芫','翀茂','翎轩','翎轲','翎轼','翎宁','翎安','翎宆','翎宐','翎实','翎宜','翎宖','翎宣','翎宸','翎家','翎容','翎甲','翎申','翎畅','翎畇','翎禾','翎秉','翎科','翎秞','翎秩','翎秷','翎酟','翎苏','翎蔚','翎芫','翎茂','翊轩','翊轲','翊轼','翊宁','翊安','翊宆','翊宐','翊实','翊宜','翊宖','翊宣','翊宸','翊家','翊容','翊甲','翊申','翊畅','翊畇','翊禾','翊秉','翊科','翊秞','翊秩','翊秷','翊酟','翊苏','翊蔚','翊芫','翊茂','翐轩','翐轲','翐轼','翐宁','翐安','翐宆','翐宐','翐实','翐宜','翐宖','翐宣','翐宸','翐家','翐容','翐甲','翐申','翐畅','翐畇','翐禾','翐秉','翐科','翐秞','翐秩','翐秷','翐酟','翐苏','翐蔚','翐芫','翐茂','翕轩','翕轲','翕轼','翕宁','翕安','翕宆','翕宐','翕实','翕宜','翕宖','翕宣','翕宸','翕家','翕容','翕甲','翕申','翕畅','翕畇','翕禾','翕秉','翕科','翕秞','翕秩','翕秷','翕酟','翕苏','翕蔚','翕芫','翕茂','翓轩','翓轲','翓轼','翓宁','翓安','翓宆','翓宐','翓实','翓宜','翓宖','翓宣','翓宸','翓家','翓容','翓甲','翓申','翓畅','翓畇','翓禾','翓秉','翓科','翓秞','翓秩','翓秷','翓酟','翓苏','翓蔚','翓芫','翓茂','甲轩','甲轲','甲轼','甲宁','甲安','甲宆','甲宐','甲实','甲宜','甲宖','甲宣','甲宸','甲家','甲容','甲羿','甲翀','甲翎','甲翊','甲翐','甲翕','甲翓','甲禾','甲秉','甲科','甲秞','甲秩','甲秷','甲酟','甲苏','甲蔚','甲芫','甲茂','申轩','申轲','申轼','申宁','申安','申宆','申宐','申实','申宜','申宖','申宣','申宸','申家','申容','申羿','申翀','申翎','申翊','申翐','申翕','申翓','申禾','申秉','申科','申秞','申秩','申秷','申酟','申苏','申蔚','申芫','申茂','畅轩','畅轲','畅轼','畅宁','畅安','畅宆','畅宐','畅实','畅宜','畅宖','畅宣','畅宸','畅家','畅容','畅羿','畅翀','畅翎','畅翊','畅翐','畅翕','畅翓','畅禾','畅秉','畅科','畅秞','畅秩','畅秷','畅酟','畅苏','畅蔚','畅芫','畅茂','畇轩','畇轲','畇轼','畇宁','畇安','畇宆','畇宐','畇实','畇宜','畇宖','畇宣','畇宸','畇家','畇容','畇羿','畇翀','畇翎','畇翊','畇翐','畇翕','畇翓','畇禾','畇秉','畇科','畇秞','畇秩','畇秷','畇酟','畇苏','畇蔚','畇芫','畇茂','禾轩','禾轲','禾轼','禾宁','禾安','禾宆','禾宐','禾实','禾宜','禾宖','禾宣','禾宸','禾家','禾容','禾羿','禾翀','禾翎','禾翊','禾翐','禾翕','禾翓','禾甲','禾申','禾畅','禾畇','禾酟','禾苏','禾蔚','禾芫','禾茂','秉轩','秉轲','秉轼','秉宁','秉安','秉宆','秉宐','秉实','秉宜','秉宖','秉宣','秉宸','秉家','秉容','秉羿','秉翀','秉翎','秉翊','秉翐','秉翕','秉翓','秉甲','秉申','秉畅','秉畇','秉酟','秉苏','秉蔚','秉芫','秉茂','科轩','科轲','科轼','科宁','科安','科宆','科宐','科实','科宜','科宖','科宣','科宸','科家','科容','科羿','科翀','科翎','科翊','科翐','科翕','科翓','科甲','科申','科畅','科畇','科酟','科苏','科蔚','科芫','科茂','秞轩','秞轲','秞轼','秞宁','秞安','秞宆','秞宐','秞实','秞宜','秞宖','秞宣','秞宸','秞家','秞容','秞羿','秞翀','秞翎','秞翊','秞翐','秞翕','秞翓','秞甲','秞申','秞畅','秞畇','秞酟','秞苏','秞蔚','秞芫','秞茂','秩轩','秩轲','秩轼','秩宁','秩安','秩宆','秩宐','秩实','秩宜','秩宖','秩宣','秩宸','秩家','秩容','秩羿','秩翀','秩翎','秩翊','秩翐','秩翕','秩翓','秩甲','秩申','秩畅','秩畇','秩酟','秩苏','秩蔚','秩芫','秩茂','秷轩','秷轲','秷轼','秷宁','秷安','秷宆','秷宐','秷实','秷宜','秷宖','秷宣','秷宸','秷家','秷容','秷羿','秷翀','秷翎','秷翊','秷翐','秷翕','秷翓','秷甲','秷申','秷畅','秷畇','秷酟','秷苏','秷蔚','秷芫','秷茂','酟轩','酟轲','酟轼','酟宁','酟安','酟宆','酟宐','酟实','酟宜','酟宖','酟宣','酟宸','酟家','酟容','酟羿','酟翀','酟翎','酟翊','酟翐','酟翕','酟翓','酟甲','酟申','酟畅','酟畇','酟禾','酟秉','酟科','酟秞','酟秩','酟秷','酟苏','酟蔚','酟芫','酟茂','苏轩','苏轲','苏轼','苏宁','苏安','苏宆','苏宐','苏实','苏宜','苏宖','苏宣','苏宸','苏家','苏容','苏羿','苏翀','苏翎','苏翊','苏翐','苏翕','苏翓','苏甲','苏申','苏畅','苏畇','苏禾','苏秉','苏科','苏秞','苏秩','苏秷','苏酟','蔚轩','蔚轲','蔚轼','蔚宁','蔚安','蔚宆','蔚宐','蔚实','蔚宜','蔚宖','蔚宣','蔚宸','蔚家','蔚容','蔚羿','蔚翀','蔚翎','蔚翊','蔚翐','蔚翕','蔚翓','蔚甲','蔚申','蔚畅','蔚畇','蔚禾','蔚秉','蔚科','蔚秞','蔚秩','蔚秷','蔚酟','芫轩','芫轲','芫轼','芫宁','芫安','芫宆','芫宐','芫实','芫宜','芫宖','芫宣','芫宸','芫家','芫容','芫羿','芫翀','芫翎','芫翊','芫翐','芫翕','芫翓','芫甲','芫申','芫畅','芫畇','芫禾','芫秉','芫科','芫秞','芫秩','芫秷','芫酟','茂轩','茂轲','茂轼','茂宁','茂安','茂宆','茂宐','茂实','茂宜','茂宖','茂宣','茂宸','茂家','茂容','茂羿','茂翀','茂翎','茂翊','茂翐','茂翕','茂翓','茂甲','茂申','茂畅','茂畇','茂禾','茂秉','茂科','茂秞','茂秩','茂秷','茂酟']

m=0
input_name=[]
input_score=[]
while m in range(len(all_h_name)):
    post_name=all_h_name[m]
    postdata={'xs':'鲍','mz':post_name,'action':'test'}
    headers={'content-type':'application/x-www-form-urlencoded'}
    ori=requests.post('https://www.xingming.com/dafen/',data=postdata,headers=headers)
    responed=BeautifulSoup(ori.text)
    score=responed.findAll('p' and 'b')
    number_str=score[13]
    input_name.append(post_name)
    input_score.append(number_str)
    print('姓名：'+post_name,number_str)
    m+=1

dataframe=pd.DataFrame({'姓名':input_name,'分数':input_score})
dataframe.to_csv('/Users/danawang/Desktop/score.csv',index=True,sep=',')
    
    
    
    
    
    
    
    